tutorials/cases/charOnlyMoveCases/parallel/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application porousGasificationFoam;

startFrom       startTime;

startTime       0; 

stopAt          endTime;

endTime         10;

deltaT          1e-3;

maxDeltaT	    0.001;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep yes;

maxCo      1; 

maxDi      5000;

functions
{
//    #includeFunc  probes
//    #includeFunc  sample

    // Regression-test scalars (see applications/test/regression/).
    // The include is silent if the file is absent, so removing
    // regressionFunctions reverts the case to its original behaviour.
    #includeIfPresent "regressionFunctions"

    // ---- TUI-monitor support (probes panel + heatmap validation) ---- //

    // Probes at inlet/outlet sides, through the bed height (z), so the
    // monitor's probes panel has live data during the run.  Sampling only —
    // does not affect the solution.  Locations scaled to this case's
    // larger domain (x in [0, 0.099], z in [0, 0.13]).
    probes
    {
        type            probes;
        libs            (sampling);
        enabled         true;
        writePrecision  10;
        writeControl    timeStep;
        writeInterval   1;
        fields          (Ts porosityF Ychar);
        probeLocations
        (
            (0.01  0 0.065)   // inlet-mid
            (0.089 0 0.065)   // outlet-mid
            (0.01  0 0.03)    // inlet-bot
            (0.089 0 0.03)    // outlet-bot
            (0.01  0 0.10)    // inlet-top
            (0.089 0 0.10)    // outlet-top
        );
    }
}

// ************************************************************************* //
